test/xml/request_signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#TS-B862677E7F972AA9CAAB"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>VUwD4V5YssP2ZO7sDycLbVBhQ5A=</ds:DigestValue></ds:Reference><ds:Reference URI="#ID-B862677E7F972AA9CAAB"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>CQCiZfCD2fobargrOYofff8L410=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>JoeIib2xL8nWqx+alqtO2K0KkJo9KJQEbt9UboFuiwfL6zqIp71Gn1m7ItAuiMDTMxnSv8LqAeDHtD6eXi1oyd3tw+CrEk76BjzN2FVW7bmLvnHDuO7JZ7DCo8QkO8BYzZkI6KOCTRVo2skv5jCchPHOQ/UH79vZfNnMzSNjwsnLg/jpTIWkeKUSzLY9qPjIFXNqoezsk4XT9jxVfIXDRCx8uo41fIKwr5dvhUA0sLSJ8vTs/Bz3MfV2/KRazke1kMcQI4o7WIQTDYk5e7DYbFwtvJE+I5tTAevJytqai7D/WGtMNU+pU6LRLDtf2tWtl5zKqejiSwyIPk+PFIPtOA==</ds:SignatureValue><ds:KeyInfo xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="KI-B862677E7F972AA9CAAB"></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-B862677E7F972AA9CAAB"><wsu:Created>2020-03-09T13:44:00+00:00</wsu:Created><wsu:Expires>2020-03-09T14:14:00+00:00</wsu:Expires></wsu:Timestamp></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ID-B862677E7F972AA9CAAB"><mpay:GetOrderDetails xmlns:mpay="https://mpay.gov.md/"><mpay:query><mpay:OrderKey>3BEEA3B3-B2C3-46AC-96F4-44FC4DAA9AED</mpay:OrderKey><mpay:ServiceID>MPaySampleService</mpay:ServiceID><mpay:Language>ro</mpay:Language></mpay:query></mpay:GetOrderDetails></soapenv:Body></soapenv:Envelope>